//
//  Data.swift
//  DogFoodHub
//
//  Created by Mai Mouri on 2022/06/06.
//

import Foundation

class DogfoodData {
    let dogfoods = [
        [
            "name": "アーテミス フレッシュミックス スモールブリードアダルト3kg",
            "content": 3000,
            "brand": "ARTEMIS",
            "category": "Small Breed",
            "lifeStage": "All",
            "ingredients": "フレッシュチキン・ドライチキン・フレッシュターキー・玄米・黍・えんどう豆・えんどう豆粉・卵・鶏脂肪(混合トコフェロールによる保 存処理済)・トマト搾り粕(リコピン)・フレッシュダック・フレッシュサーモン・フラックスシード・チキンスープ(天然風味料)・サーモン オイル(DHA 源)・塩・塩化カリウム・塩化コリン・乾燥チコリ根・ケルプ・人参・リンゴ・トマト・ブルーベリー・ほうれん草・クランベリ ー・ローズマリーエキス・パセリフレーク・グリーンティエキス・大麦エキス・L-カルニチン・ラクトバチルスアシドフィルス菌・ビフィド バクテリウム アニマリス・ラクトバチルスロイテリ・ビタミン E・キレート鉄・キレート亜鉛・キレート銅・硫酸第一鉄・硫酸亜鉛・硫酸 銅・ヨウ化カリウム・チアミン硝酸塩・キレートマンガン・酸化マンガン・アスコルビン酸・ビタミン A・ビオチン・パントテン酸カルシウ ム・硫酸マンガン・亜セレン酸ナトリウム・ピリドキシン塩酸塩(ビタミン B6)・ビタミン B12・リボフラビン・ビタミン D・葉酸",
            "description": "",
            "madeIn": "America",
            "foodType": "Dry",
            "imageUrl": "https://tshop.r10s.jp/dogparadise/cabinet/img00_2/0813369001904.jpg?downsize=240:*",
            "url": "https://item.rakuten.co.jp/dogparadise/4562192370942/",
            "price": 4620,
            "sku": ""
        ],
        [
            "name": "ニュートロ シュプレモ 小型犬用 成犬用 3kg",
            "content": 3000,
            "brand": "Nutro",
            "category": "Small Breed",
            "lifeStage": "All",
            "ingredients": "チキン（肉）、チキンミール、モロコシ*2、オーツ麦*3、玄米*4、鶏脂*1*5、タンパク加水分解物、ラムミール*6、サーモンミール*7、粗挽き米、ビートパルプ、大麦*3、亜麻仁*2*8、チアシード*2*3*8、ココナッツ*9、乾燥卵、トマト*2、ケール*2、パンプキン*2、ホウレン草*2*10、ブルーベリー*2、リンゴ*2、ニンジン*2、ビタミン類（A、B1、B2、B6、B12、C、D3、E、コリン、ナイアシン、パントテン酸、ビオチン、葉酸）、ミネラル類（カリウム、クロライド、セレン、ナトリウム、マンガン、ヨウ素、亜鉛、鉄、銅）、アミノ酸類（メチオニン）、酸化防止剤（ミックストコフェロール、ローズマリー抽出物、クエン酸） *1 ミックストコフェロールで保存 *2 抗酸化成分含、*3 食物繊維含、*4 ビタミン、ミネラル含、*5 ω-6脂肪酸含、*6 カルニチン、ビタミンB群含、*7 DHA、EPA含、*8 α-リノレン酸含、*9 中鎖脂肪酸、カリウム含、*10 鉄分含",
            "description": "★15種類の厳選自然素材のホリスティックブレンド★\n元気な体、美しい皮膚・被毛、消化吸収の健康維持に配慮！\n栄養素を豊富に含む高品質な自然素材を厳選、最適な栄養バランスでブレンドしています。\nまた、顎・口が小さい、代謝エネルギーが高いなどの超小型犬～小型犬の特徴に配慮しています。",
            "madeIn": "America",
            "foodType": "Dry",
            "imageUrl": "https://tshop.r10s.jp/dog-kan/cabinet/09074909/9225466-e.jpg?downsize=240:*",
            "url": "https://item.rakuten.co.jp/dogparadise/4562192370942/",
            "price": 3510,
            "sku": ""
        ],
        [
            "name": "セレクトバランス アダルト チキン 小粒 7kg",
            "content": 7000,
            "brand": "Select Balance",
            "category": "Small Breed",
            "lifeStage": "Adult 1-7 Yrs",
            "ingredients": "乾燥チキン、とうもろこし、米、玄米、ソイビーンミール、鶏脂（オメガ6脂肪酸・オメガ3脂肪酸源）、ビートパルプ、チキンエキス、乾燥卵、キャノーラ油（オメガ6脂肪酸）、乾燥ミルクプロテイン、ビール酵母、クランベリー、フラクトオリゴ糖、グルコサミン、コンドロイチン、コエンザイムQ10\nビタミン類（A, D, E, K, B 1 , B 2 , B 6 , B 12 , ナイアシン, パントテン酸, 葉酸, ビオチン, コリン）\nミネラル類（カルシウム, リン, カリウム, ナトリウム, クロライド, 硫酸亜鉛, 鉄, 銅, マンガン, セレン, ヨウ素）\n酸化防止剤（ミックストコフェロール,クエン酸, ローズマリー抽出物）",
            "description": "１才以上の成犬用の健康維持に必要な栄養をバランスよく含んでいます。\nセレクトバランス\nアダルトは、生後1才以上の成犬に必要な栄養をバランスよく配合した総合栄養食です。成犬の暮らしに必要な栄養成分基準を満たし、毎日の生活をサポートします。",
            "madeIn": "America",
            "foodType": "Dry",
            "imageUrl": "https://tshop.r10s.jp/capcap/cabinet/06442136/06442139/imgrc0073292102.jpg?downsize=240:*",
            "url": "https://item.rakuten.co.jp/capcap/10000177/",
            "price": 6820,
            "sku": ""
        ],
    ]
    
}
